Autodesk.Revit.DB.Structure.RebarConstraintType
The various types of constraints that can be applied to a RebarConstrainedHandle.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintType.ToOtherRebar
Handle is attached to a handle on another Rebar Element.  Only applies to
Standard style bars, which can be constrained to Stirrup style bars.

Autodesk.Revit.DB.Structure.RebarConstraintType.ToCover
Handle is attached to the cover of a host Element surface.

Autodesk.Revit.DB.Structure.RebarConstraintType.FixedDistanceToHostFace
Handle is constrained to remain a fixed distance from a host Element surface.